# 根据字典，批量将地图名文件改为adcode文件

import os

# 创建一个字典，将地图名映射到相应的代码
name_to_code_mapping = {
    "上城区": "330102",
    "拱墅区": "330105",
    "西湖区": "330106",
    "滨江区": "330108",
    "萧山区": "330109",
    "余杭区": "330110",
    "富阳区": "330111",
    "临安区": "330112",
    "钱塘区": "330114",
    "临平区": "330113",
    "桐庐县": "330122",
    "淳安县": "330127",
    "建德市": "330182",
    "海曙区": "330203",
    "江北区": "330205",
    "北仑区": "330206",
    "镇海区": "330211",
    "鄞州区": "330212",
    "奉化区": "330213",
    "象山县": "330225",
    "宁海县": "330226",
    "余姚市": "330281",
    "慈溪市": "330282",
    "鹿城区": "330302",
    "龙湾区": "330303",
    "瓯海区": "330304",
    "洞头区": "330305",
    "永嘉县": "330324",
    "平阳县": "330326",
    "苍南县": "330327",
    "文成县": "330328",
    "泰顺县": "330329",
    "温州经济技术开发区": "330371",
    "瑞安市": "330381",
    "乐清市": "330382",
    "龙港市": "330383",
    "南湖区": "330402",
    "秀洲区": "330411",
    "嘉善县": "330421",
    "海盐县": "330424",
    "海宁市": "330481",
    "平湖市": "330482",
    "桐乡市": "330483",
    "吴兴区": "330502",
    "南浔区": "330503",
    "德清县": "330521",
    "长兴县": "330522",
    "安吉 县": "330523",
    "越城区": "330602",
    "柯桥区": "330603",
    "上虞区": "330604",
    "新昌县": "330624",
    "诸暨市": "330681",
    "嵊州市": "330683",
    " 婺城区": "330702",
    "金东区": "330703",
    "武义县": "330723",
    "浦江县": "330726",
    "磐安县": "330727",
    "兰溪市": "330781",
    "义乌市": "330782",
    "东阳市": "330783",
    "永康市": "330784",
    "柯城区": "330802",
    "衢江区": "330803",
    "常山县": "330822",
    "开化县": "330824",
    "龙游县": "330825",
    "江山市": "330881",
    "定海区": "330902",
    "普陀区": "330903",
    "岱山县": "330921",
    "嵊泗县": "330922",
    "椒江区": "331002",
    "黄岩区": "331003",
    "路桥区": "331004",
    "三门县": "331022",
    "天台县": "331023",
    "仙居县": "331024",
    "温岭市": "331081",
    "临海市": "331082",
    "玉环市": "331083",
    "莲都区": "331102",
    "青田县": "331121",
    "缙云县": "331122",
    "遂昌县": "331123",
    "松阳县": "331124",
    "云和县": "331125",
    "庆元 县": "331126",
    "景宁畲族自治县": "331127",
    "龙泉市": "331181"
    # 其他映射...
}

# 指定多个文件夹路径
directories = [
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\吉林市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\四平市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\延边朝鲜族自治州\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\松原市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\白城市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\白山市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\辽源市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\通化市\code",
    r"D:\梁智杰\BMDownload\浙江\总kml\json"
    # 添加更多目录...
]

for directory in directories:
    for filename in os.listdir(directory):
        if filename.endswith(".json"):
            # 提取地图名（去掉.json后缀）
            map_name = filename[:-5]

            # 获取新的代码
            code = name_to_code_mapping.get(map_name)

            if code:
                # 构造新的文件名
                new_filename = f"{code}.json"

                # 获取完整的原文件和新文件路径
                old_filepath = os.path.join(directory, filename)
                new_filepath = os.path.join(directory, new_filename)

                # 重命名文件
                os.rename(old_filepath, new_filepath)
            else:
                print(f"未找到 '{map_name}' 的映射代码")
