# 根据字典，批量将地图名文件改为adcode文件

import os

# 创建一个字典，将地图名映射到相应的代码
name_to_code_mapping = {
    "鼓楼区": "350102",
    "台江区": "350103",
    "仓山区": "350104",
    "马尾区": "350105",
    "晋安区": "350111",
    "长乐区": "350112",
    "闽侯县": "350121",
    "连江县": "350122",
    "罗源县": "350123",
    "闽清县": "350124",
    "永泰县": "350125",
    "平潭县": "350128",
    "福清市": "350181",
    "思明区": "350203",
    "海沧区": "350205",
    "湖里区": "350206",
    "集美区": "350211",
    "同安区": "350212",
    "翔安区": "350213",
    "城厢区": "350302",
    "涵江区": "350303",
    "荔城区": "350304",
    "秀屿区": "350305",
    "仙游县": "350322",
    "三元区": "350403",
    "明溪县": "350421",
    "清流县": "350423",
    "宁化县": "350424",
    "大田县": "350425",
    "尤溪县": "350426",
    "沙县区": "350427",
    "将乐县": "350428",
    "泰宁县": "350429",
    "建宁县": "350430",
    "永安市": "350481",
    "鲤城区": "350502",
    "丰泽区": "350503",
    "洛江区": "350504",
    "泉港区": "350505",
    "惠安县": "350521",
    "安溪县": "350524",
    "永春县": "350525",
    "德化县": "350526",
    "金门县": "350527",
    "石狮市": "350581",
    "晋江市": "350582",
    "南安市": "350583",
    "芗城区": "350602",
    "龙文区": "350603",
    "云霄县": "350622",
    "漳浦县": "350623",
    "诏安县": "350624",
    "长泰区": "350625",
    "东山县": "350626",
    "南靖县": "350627",
    "平和县": "350628",
    "华安县": "350629",
    "龙海区": "350681",
    "延平区": "350702",
    "建阳区": "350703",
    "顺昌县": "350721",
    "浦城县": "350722",
    "光泽县": "350723",
    "松溪县": "350724",
    "政和县": "350725",
    "邵武市": "350781",
    "武夷山市": "350782",
    "建瓯市": "350783",
    "新罗区": "350802",
    "永定区": "350803",
    "长汀县": "350821",
    "上杭县": "350823",
    "武平县": "350824",
    "连城县": "350825",
    "漳平市": "350881",
    "蕉城区": "350902",
    "霞浦县": "350921",
    "古田县": "350922",
    "屏南县": "350923",
    "寿宁县": "350924",
    "周宁县": "350925",
    "柘荣县": "350926",
    "福安市": "350981",
    "福鼎市": "350982"
    # 其他映射...
}

# 指定多个文件夹路径
directories = [
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\吉林市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\四平市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\延边朝鲜族自治州\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\松原市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\白城市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\白山市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\辽源市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\通化市\code",
    r"D:\梁智杰\BMDownload\福建\总kml\json"
    # 添加更多目录...
]

for directory in directories:
    for filename in os.listdir(directory):
        if filename.endswith(".json"):
            # 提取地图名（去掉.json后缀）
            map_name = filename[:-5]

            # 获取新的代码
            code = name_to_code_mapping.get(map_name)

            if code:
                # 构造新的文件名
                new_filename = f"{code}.json"

                # 获取完整的原文件和新文件路径
                old_filepath = os.path.join(directory, filename)
                new_filepath = os.path.join(directory, new_filename)

                # 重命名文件
                os.rename(old_filepath, new_filepath)
            else:
                print(f"未找到 '{map_name}' 的映射代码")
