# 根据字典，批量将地图名文件改为adcode文件

import os

# 创建一个字典，将地图名映射到相应的代码
name_to_code_mapping = {
    "江岸区": "420102",
    "江汉区": "420103",
    "硚口区": "420104",
    "汉阳区": "420105",
    "武昌区": "420106",
    "青山区": "420107",
    "洪山区": "420111",
    "东西湖区": "420112",
    "汉南区": "420113",
    "蔡甸区": "420114",
    "江夏区": "420115",
    "黄陂区": "420116",
    "新洲区": "420117",
    "黄石港区": "420202",
    "西塞山区": "420203",
    "下陆区": "420204",
    "铁山区": "420205",
    "阳新县": "420222",
    "大冶市": "420281",
    "茅箭区": "420302",
    "张湾区": "420303",
    "郧阳区": "420304",
    "郧西县": "420322",
    "竹山县": "420323",
    "竹溪县": "420324",
    "房县": "420325",
    "丹江口市": "420381",
    "西陵区": "420502",
    "伍家岗区": "420503",
    "点军区": "420504",
    "猇亭区": "420505",
    "夷陵区": "420506",
    "远安县": "420525",
    "兴山县": "420526",
    "秭归县": "420527",
    "长阳土家族自治县": "420528",
    "五峰土家族自治县": "420529",
    "宜都市": "420581",
    "当阳市": "420582",
    "枝江市": "420583",
    "襄城区": "420602",
    "樊城区": "420606",
    "襄州区": "420607",
    "南漳县": "420624",
    "谷城县": "420625",
    "保康县": "420626",
    "老河口市": "420682",
    "枣阳市": "420683",
    "宜城市": "420684",
    "梁子湖区": "420702",
    "华容区": "420703",
    "鄂城区": "420704",
    "东宝区": "420802",
    "掇刀区": "420804",
    "沙洋县": "420822",
    "钟祥市": "420881",
    "京山市": "420882",
    "孝南区": "420902",
    "孝昌县": "420921",
    "大悟县": "420922",
    "云梦县": "420923",
    "应城市": "420981",
    "安陆市": "420982",
    "汉川市": "420984",
    "沙市区": "421002",
    "荆州区": "421003",
    "公安县": "421022",
    "监利市": "421023",
    "江陵县": "421024",
    "荆州经济技术开发区": "421071",
    "石首市": "421081",
    "洪湖市": "421083",
    "松滋市": "421087",
    "黄州区": "421102",
    "团风县": "421121",
    "红安县": "421122",
    "罗田县": "421123",
    "英山县": "421124",
    "浠水县": "421125",
    "蕲春县": "421126",
    "黄梅县": "421127",
    "龙感湖管理区": "421171",
    "麻城市": "421181",
    "武穴市": "421182",
    "咸安区": "421202",
    "嘉鱼县": "421221",
    "通城县": "421222",
    "崇阳县": "421223",
    "通山县": "421224",
    "赤壁市": "421281",
    "曾都区": "421303",
    "随县": "421321",
    "武汉市": "420100",
    "黄石市": "420200",
    "十堰市": "420300",
    "宜昌市": "420500",
    "襄阳市": "420600",
    "鄂州市": "420700",
    "荆门市": "420800",
    "孝感市": "420900",
    "荆州市": "421000",
    "黄冈市": "421100",
    "咸宁市": "421200",
    "随州市": "421300",
    "恩施土家族苗族自治州": "422800",
    "仙桃市": "429004",
    "潜江市": "429005",
    "天门市": "429006",
    "神农架林区": "429021",
    "广水市": "421381",
    "恩施市": "422801",
    "利川市": "422802",
    "建始县": "422822",
    "巴东县": "422823",
    "宣恩县": "422825",
    "咸丰县": "422826",
    "来凤县": "422827",
    "鹤峰县": "422828"
    # 其他映射...
}

# 指定多个文件夹路径
directories = [
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\吉林市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\四平市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\延边朝鲜族自治州\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\松原市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\白城市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\白山市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\辽源市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\通化市\code",
    r"D:\梁智杰\BMDownload\湖北\总kml\json"
    # 添加更多目录...
]

for directory in directories:
    for filename in os.listdir(directory):
        if filename.endswith(".json"):
            # 提取地图名（去掉.json后缀）
            map_name = filename[:-5]

            # 获取新的代码
            code = name_to_code_mapping.get(map_name)

            if code:
                # 构造新的文件名
                new_filename = f"{code}.json"

                # 获取完整的原文件和新文件路径
                old_filepath = os.path.join(directory, filename)
                new_filepath = os.path.join(directory, new_filename)

                # 重命名文件
                os.rename(old_filepath, new_filepath)
            else:
                print(f"未找到 '{map_name}' 的映射代码")
