# 根据字典，批量将地图名文件改为adcode文件

import os

# 创建一个字典，将地图名映射到相应的代码
name_to_code_mapping = {
    "南明区": "520102",
    "云岩区": "520103",
    "花溪区": "520111",
    "乌当区": "520112",
    "白云区": "520113",
    "观山湖区": "520115",
    "开阳县": "520121",
    "息烽县": "520122",
    "修文县": "520123",
    "清镇市": "520181",
    "钟山区": "520201",
    "六枝特区": "520203",
    "水城区": "520221",
    "盘州市": "520281",
    "红花岗区": "520302",
    "汇川区": "520303",
    "播州区": "520304",
    "桐梓县": "520322",
    "绥阳县": "520323",
    "正安县": "520324",
    "道真仡佬族苗族自治县": "520325",
    "务川仡佬族苗族自治县": "520326",
    "凤冈县": "520327",
    "湄潭县": "520328",
    "余庆县": "520329",
    "习水县": "520330",
    "赤水市": "520381",
    "仁怀市": "520382",
    "西秀区": "520402",
    "平坝区": "520403",
    "普定县": "520422",
    "镇宁布依族苗族自治县": "520423",
    "关岭布依族苗族自治县": "520424",
    "紫云苗族布依族自治县": "520425",
    "七星关区": "520502",
    "大方县": "520521",
    "黔西市": "520522",
    "金沙县": "520523",
    "织金县": "520524",
    "纳雍县": "520525",
    "威宁彝族回族苗族自治县": "520526",
    "赫章县": "520527",
    "碧江区": "520602",
    "万山区": "520603",
    "江口县": "520621",
    "玉屏侗族自治县": "520622",
    "石阡县": "520623",
    "思南县": "520624",
    "印江土家族苗族自治县": "520625",
    "德江县": "520626",
    "沿河土家族自治县": "520627",
    "松桃苗族自治县": "520628",
    "兴义市": "522301",
    "兴仁市": "522302",
    "普安县": "522323",
    "晴隆县": "522324",
    "贞丰县": "522325",
    "望谟县": "522326",
    "册亨县": "522327",
    "安龙县": "522328",
    "凯里市": "522601",
    "黄平县": "522622",
    "施秉县": "522623",
    "三穗县": "522624",
    "镇远县": "522625",
    "岑巩县": "522626",
    "天柱县": "522627",
    "锦屏县": "522628",
    "剑河县": "522629",
    "台江县": "522630",
    "黎平县": "522631",
    "榕江县": "522632",
    "从江县": "522633",
    "雷山县": "522634",
    "麻江县": "522635",
    "丹寨县": "522636",
    "都匀市": "522701",
    "福泉市": "522702",
    "荔波县": "522722",
    "贵定县": "522723",
    "瓮安县": "522725",
    "独山县": "522726",
    "平塘县": "522727",
    "罗甸县": "522728",
    "长顺县": "522729",
    "龙里县": "522730",
    "惠水县": "522731",
    "三都水族自治县": "522732"
    # 其他映射...
}

# 指定多个文件夹路径
directories = [
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\通化市\code",
    r"D:\梁智杰\BMDownload\贵州\总kml\json"
    # 添加更多目录...
]

for directory in directories:
    for filename in os.listdir(directory):
        if filename.endswith(".json"):
            # 提取地图名（去掉.json后缀）
            map_name = filename[:-5]

            # 获取新的代码
            code = name_to_code_mapping.get(map_name)

            if code:
                # 构造新的文件名
                new_filename = f"{code}.json"

                # 获取完整的原文件和新文件路径
                old_filepath = os.path.join(directory, filename)
                new_filepath = os.path.join(directory, new_filename)

                # 重命名文件
                os.rename(old_filepath, new_filepath)
            else:
                print(f"未找到 '{map_name}' 的映射代码")
