# 根据字典，批量将地图名文件改为adcode文件

import os

# 创建一个字典，将地图名映射到相应的代码
name_to_code_mapping = {
    "玄武区": "320102",
    "秦淮区": "320104",
    "建邺区": "320105",
    "鼓楼区": "320302",
    "浦口区": "320111",
    "栖霞区": "320113",
    "雨花台区": "320114",
    "江宁区": "320115",
    "六合区": "320116",
    "溧水区": "320117",
    "高淳区": "320118",
    "锡山区": "320205",
    "惠山区": "320206",
    "滨湖区": "320211",
    "梁溪区": "320213",
    "新吴区": "320214",
    "江阴市": "320281",
    "宜兴市": "320282",
    "云龙区": "320303",
    "贾汪区": "320305",
    "泉山区": "320311",
    "铜山区": "320312",
    "丰县": "320321",
    "沛县": "320322",
    "睢宁县": "320324",
    "徐州经济技术开发区": "320371",
    "新沂市": "320381",
    "邳州市": "320382",
    "天宁区": "320402",
    "钟楼区": "320404",
    "新北区": "320411",
    "武进区": "320412",
    "金坛区": "320413",
    "溧阳市": "320481",
    "虎丘区": "320505",
    "吴中区": "320506",
    "相城区": "320507",
    "姑苏区": "320508",
    "吴江区": "320509",
    "苏州工业园区": "320571",
    "常熟市": "320581",
    "张家港市": "320582",
    "昆山市": "320583",
    "太仓市": "320585",
    "崇川区": "320602",
    "通州区": "320612",
    "如东县": "320623",
    "南通经济技术开发区": "320671",
    "启东市": "320681",
    "如皋市": "320682",
    "海门区": "320684",
    "海安市": "320685",
    "连云区": "320703",
    "海州区": "320706",
    "赣榆区": "320707",
    "东海县": "320722",
    "灌云县": "320723",
    "灌南县": "320724",
    "连云港经济技术开发区": "320771",
    "连云港高新技术产业开发区": "320772",
    "淮安区": "320803",
    "淮阴区": "320804",
    "清江浦区": "320812",
    "洪泽区": "320813",
    "涟水县": "320826",
    "盱眙县": "320830",
    "金湖县": "320831",
    "淮安经济技术开发区": "320871",
    "亭湖区": "320902",
    "盐都区": "320903",
    "大丰区": "320904",
    "响水县": "320921",
    "滨海县": "320922",
    "阜宁县": "320923",
    "射阳县": "320924",
    "建湖县": "320925",
    "盐城经济技术开发区": "320971",
    "东台市": "320981",
    "广陵区": "321002",
    "邗江区": "321003",
    "江都区": "321012",
    "宝应县": "321023",
    "扬州经济技术开发区": "321071",
    "仪征市": "321081",
    "高邮市": "321084",
    "京口区": "321102",
    "润州区": "321111",
    "丹徒区": "321112",
    "镇江新区": "321171",
    "丹阳市": "321181",
    "扬中市": "321182",
    "句容市": "321183",
    "海陵区": "321202",
    "高港区": "321203",
    "姜堰区": "321204",
    "泰州医药高新技术产业开发区": "321271",
    "兴化市": "321281",
    "靖江市": "321282",
    "泰兴市": "321283",
    "宿城区": "321302",
    "宿豫区": "321311",
    "沭阳县": "321322",
    "泗阳县": "321323",
    "泗洪县": "321324",
    "宿迁经济技术开发区": "321371"
    # 其他映射...
}

# 指定多个文件夹路径
directories = [
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\吉林市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\四平市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\延边朝鲜族自治州\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\松原市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\白城市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\白山市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\辽源市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\通化市\code",
    r"D:\梁智杰\BMDownload\江苏\总kml\json"
    # 添加更多目录...
]

for directory in directories:
    for filename in os.listdir(directory):
        if filename.endswith(".json"):
            # 提取地图名（去掉.json后缀）
            map_name = filename[:-5]

            # 获取新的代码
            code = name_to_code_mapping.get(map_name)

            if code:
                # 构造新的文件名
                new_filename = f"{code}.json"

                # 获取完整的原文件和新文件路径
                old_filepath = os.path.join(directory, filename)
                new_filepath = os.path.join(directory, new_filename)

                # 重命名文件
                os.rename(old_filepath, new_filepath)
            else:
                print(f"未找到 '{map_name}' 的映射代码")
