# 根据字典，批量将地图名文件改为adcode文件

import os

# 创建一个字典，将地图名映射到相应的代码
name_to_code_mapping = {
  "东湖区": "360102",
  "西湖区": "360103",
  "青云谱区": "360104",
  "青山湖区": "360111",
  "新建区": "360112",
  "红谷滩区": "360113",
  "南昌县": "360121",
  "安义县": "360123",
  "进贤县": "360124",
  "昌江区": "360202",
  "珠山区": "360203",
  "浮梁县": "360222",
  "乐平市": "360281",
  "安源区": "360302",
  "湘东区": "360313",
  "莲花县": "360321",
  "上栗县": "360322",
  "芦溪县": "360323",
  "濂溪区": "360402",
  "浔阳区": "360403",
  "柴桑区": "360404",
  "武宁县": "360423",
  "修水县": "360424",
  "永修县": "360425",
  "德安县": "360426",
  "都昌县": "360428",
  "湖口县": "360429",
  "彭泽县": "360430",
  "瑞昌市": "360481",
  "共青城市": "360482",
  "庐山市": "360483",
  "渝水区": "360502",
  "分宜县": "360521",
  "月湖区": "360602",
  "余江区": "360603",
  "贵溪市": "360681",
  "章贡区": "360702",
  "南康区": "360703",
  "赣县区": "360704",
  "信丰县": "360722",
  "大余县": "360723",
  "上犹县": "360724",
  "崇义县": "360725",
  "安远县": "360726",
  "定南县": "360728",
  "全南县": "360729",
  "宁都县": "360730",
  "于都县": "360731",
  "兴国县": "360732",
  "会昌县": "360733",
  "寻乌县": "360734",
  "石城县": "360735",
  "瑞金市": "360781",
  "龙南市": "360783",
  "吉州区": "360802",
  "青原区": "360803",
  "吉安县": "360821",
  "吉水县": "360822",
  "峡江县": "360823",
  "新干县": "360824",
  "永丰县": "360825",
  "泰和县": "360826",
  "遂川县": "360827",
  "万安县": "360828",
  "安福县": "360829",
  "永新县": "360830",
  "井冈山市": "360881",
  "袁州区": "360902",
  "奉新县": "360921",
  "万载县": "360922",
  "上高县": "360923",
  "宜丰县": "360924",
  "靖安县": "360925",
  "铜鼓县": "360926",
  "丰城市": "360981",
  "樟树市": "360982",
  "高安市": "360983",
  "临川区": "361002",
  "东乡区": "361003",
  "南城县": "361021",
  "黎川县": "361022",
  "南丰县": "361023",
  "崇仁县": "361024",
  "乐安县": "361025",
  "宜黄县": "361026",
  "金溪县": "361027",
  "资溪县": "361028",
  "广昌县": "361030",
  "信州区": "361102",
  "广丰区": "361103",
  "广信区": "361104",
  "玉山县": "361123",
  "铅山县": "361124",
  "横峰县": "361125",
  "弋阳县": "361126",
  "余干县": "361127",
  "鄱阳县": "361128",
  "万年县": "361129",
  "婺源县": "361130",
  "德兴市": "361181"
    # 其他映射...
}

# 指定多个文件夹路径
directories = [
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\吉林市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\四平市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\延边朝鲜族自治州\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\松原市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\白城市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\白山市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\辽源市\code",
    # r"C:\Users\梁智杰\Desktop\新建文件夹\my-projects\src\components\map\行政区划级联数据(含乡镇街道)\and\吉林\通化市\code",
    r"D:\梁智杰\BMDownload\江西\总kml\json"
    # 添加更多目录...
]

for directory in directories:
    for filename in os.listdir(directory):
        if filename.endswith(".json"):
            # 提取地图名（去掉.json后缀）
            map_name = filename[:-5]

            # 获取新的代码
            code = name_to_code_mapping.get(map_name)

            if code:
                # 构造新的文件名
                new_filename = f"{code}.json"

                # 获取完整的原文件和新文件路径
                old_filepath = os.path.join(directory, filename)
                new_filepath = os.path.join(directory, new_filename)

                # 重命名文件
                os.rename(old_filepath, new_filepath)
            else:
                print(f"未找到 '{map_name}' 的映射代码")
