# 创建一个字典，批量将地图名文件改为adcode文件

import os

# 创建一个字典，将地图名映射到相应的代码
name_to_code_mapping = {
"瑶海区": "340102",
"庐阳区": "340103",
"蜀山区": "340104",
"包河区": "340111",
"长丰县": "340121",
"肥东县": "340122",
"肥西县": "340123",
"庐江县": "340124",
"合肥高新技术产业开发区": "340171",
"合肥经济技术开发区": "340172",
"合肥新站高新技术产业开发区": "340173",
"巢湖市": "340181",
"镜湖区": "340202",
"鸠江区": "340207",
"弋江区": "340209",
"湾沚区": "340210",
"繁昌区": "340211",
"南陵县": "340223",
"芜湖经济技术开发区": "340271",
"安徽芜湖长江大桥经济开发区": "340272",
"无为市": "340281",
"龙子湖区": "340302",
"蚌山区": "340303",
"禹会区": "340304",
"淮上区": "340311",
"怀远县": "340321",
"五河县": "340322",
"固镇县": "340323",
"蚌埠市高新技术开发区": "340371",
"蚌埠市经济开发区": "340372",
"大通区": "340402",
"田家庵区": "340403",
"谢家集区": "340404",
"八公山区": "340405",
"潘集区": "340406",
"凤台县": "340421",
"寿县": "340422",
"花山区": "340503",
"雨山区": "340504",
"博望区": "340506",
"当涂县": "340521",
"含山县": "340522",
"和县": "340523",
"杜集区": "340602",
"相山区": "340603",
"烈山区": "340604",
"濉溪县": "340621",
"铜官区": "340705",
"义安区": "340706",
"郊区": "340711",
"枞阳县": "340722",
"迎江区": "340802",
"大观区": "340803",
"宜秀区": "340811",
"怀宁县": "340822",
"太湖县": "340825",
"宿松县": "340826",
"望江县": "340827",
"岳西县": "340828",
"安徽安庆经济开发区": "340871",
"桐城市": "340881",
"潜山市": "340882",
"屯溪区": "341002",
"黄山区": "341003",
"徽州区": "341004",
"歙县": "341021",
"休宁县": "341022",
"黟县": "341023",
"祁门县": "341024",
"琅琊区": "341102",
"南谯区": "341103",
"来安县": "341122",
"全椒县": "341124",
"定远县": "341125",
"凤阳县": "341126",
"中新苏滁高新技术产业开发区": "341171",
"滁州经济技术开发区": "341172",
"天长市": "341181",
"明光市": "341182",
"颍州区": "341202",
"颍东区": "341203",
"颍泉区": "341204",
"临泉县": "341221",
"太和县": "341222",
"阜南县": "341225",
"颍上县": "341226",
"阜阳合肥现代产业园区": "341271",
"阜阳经济技术开发区": "341272",
"界首市": "341282",
"埇桥区": "341302",
"砀山县": "341321",
"萧县": "341322",
"灵璧县": "341323",
"泗县": "341324",
"宿州马鞍山现代产业园区": "341371",
"宿州经济技术开发区": "341372",
"金安区": "341502",
"裕安区": "341503",
"叶集区": "341504",
"霍邱县": "341522",
"舒城县": "341523",
"金寨县": "341524",
"霍山县": "341525",
"谯城区": "341602",
"涡阳县": "341621",
"蒙城县": "341622",
"利辛县": "341623",
"贵池区": "341702",
"东至县": "341721",
"石台县": "341722",
"青阳县": "341723",
"宣州区": "341802",
"郎溪县": "341821",
"泾县": "341823",
"绩溪县": "341824",
"旌德县": "341825",
"宣城市经济开发区": "341871",
"宁国市": "341881",
"广德市": "341882"
}

# 指定含有目标文件的文件夹路径
directory = "C:/Users/梁智杰/Desktop/新建文件夹/my-projects/src/components/map/行政区划级联数据(含乡镇街道)/and/安徽/宣城市/code"

for filename in os.listdir(directory):
    if filename.endswith(".json"):
        # 提取地图名（去掉.json后缀）
        map_name = filename[:-5]
        
        # 获取新的代码
        code = name_to_code_mapping.get(map_name)
        
        if code:
            # 构造新的文件名
            new_filename = f"{code}.json"
            
            # 获取完整的原文件和新文件路径
            old_filepath = os.path.join(directory, filename)
            new_filepath = os.path.join(directory, new_filename)
            
            # 重命名文件
            os.rename(old_filepath, new_filepath)
        else:
            print(f"未找到 '{map_name}' 的映射代码")
